# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [243]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [244]:
# your answer here
employee = pd.read_csv("C://Users/hugoa/Ironhack/Week_3/Day_2/Afternoon/lab-pivot-table-and-correlation/your_code/data/Employee.csv")

In [245]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [246]:
# Method 1
# your answer here

#With groupby
employee.groupby(['Department']).agg({'Salary':"mean"}).reset_index(drop=False)

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

In [247]:
#With pivot_table
pd.pivot_table(employee, columns="Department", aggfunc='mean', values='Salary')

Department    HR     IT  Sales
Salary      45.0  48.75   55.0

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [248]:
# Method 2
# your answer here
pd.pivot_table(employee, columns=["Department", "Title"], aggfunc='mean', values='Salary')

Department    HR            IT                       Sales
Title         VP analyst    VP analyst associate associate
Salary      70.0    32.5  70.0    32.5      60.0      55.0

In [249]:
# your answer here

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [250]:
# your answer here
pd.pivot_table(employee, columns=["Title"], aggfunc='mean', values=['Salary', "Years"])

Title     VP  analyst  associate
Salary  70.0    32.50  56.666667
Years    8.0     2.25   4.000000

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [251]:
# your answer here
pd.pivot_table(employee, columns=["Department", "Title"], aggfunc= {'Salary': np.mean, 'Name': "count"}, values=[ "Salary","Name"])

Department    HR            IT                       Sales
Title         VP analyst    VP analyst associate associate
Name         1.0     2.0   1.0     2.0       1.0       2.0
Salary      70.0    32.5  70.0    32.5      60.0      55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [252]:
# your answer here
pd.pivot_table(employee, columns=["Department", "Title"], aggfunc=['median', min,max, "std"] , values=['Salary'])

           median                                           min              \
Department     HR            IT                       Sales  HR          IT
Title          VP analyst    VP analyst associate associate  VP analyst  VP
Salary       70.0    32.5  70.0    32.5      60.0      55.0  70      30  70

                    ...           max                                          \
Department          ...     Sales  HR          IT                       Sales
Title      analyst  ... associate  VP analyst  VP analyst associate associate
Salary          30  ...        55  70      35  70      35        60        55

                 std
Department        HR        IT     Sales
Title        analyst   analyst associate
Salary      3.535534  3.535534       0.0

[1 rows x 21 columns]

#### Based on your comments, fill the missing values with an appropriate value.

In [253]:
# your answer here

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [254]:
# your answer here
pd.pivot_table(employee, columns=["Department"], aggfunc= {'Salary': sum, 'Name': "count"}, values=[ "Salary","Name"])

Department   HR   IT  Sales
Name          3    4      2
Salary      135  195    110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [255]:
# your answer here
pd.pivot_table(employee, columns=["Department", "Title"], aggfunc= {'Years': sum, 'Salary': "mean"}, values=[ "Salary","Years"])

Department    HR            IT                       Sales
Title         VP analyst    VP analyst associate associate
Salary      70.0    32.5  70.0    32.5      60.0      55.0
Years        8.0     6.0   8.0     3.0       7.0       5.0

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [261]:
# your answer here
maxima= pd.pivot_table(employee, columns=["Department"], aggfunc= {'Salary':  max }, values="Salary").T
maxima

            Salary
Department
HR              70
IT              70
Sales           55

In [272]:
#Filter the original table excluding the maximum values found previously
filtered = employee[~employee['Salary'].isin(list(maxima['Salary']))]
filtered

    Name Department Education Gender      Title  Years  Salary
0   Jose         IT  Bachelor      M    analyst      1      35
1  Maria         IT    Master      F    analyst      2      30
2  David         HR    Master      M    analyst      2      30
3  Sonia         HR  Bachelor      F    analyst      4      35
7  Pedro         IT       Phd      M  associate      7      60

In [271]:
# Mean values after exclusion of maximum, we can see that sales has no mean because it had two values of 55.
mean= pd.pivot_table(filtered, columns=["Department"], aggfunc= {'Salary': "mean"}, values="Salary")
mean

Department    HR         IT
Salary      32.5  41.666667